# St7GetNumGroups

Returns the number of groups in a Strand7 model.

long St7GetNumGroups(long uID, long* NumGroups)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

Output Parameters
NumGroups

The number of groups.